//**1 */
//Дана строка 'aaa@bbb@ccc'. Замените все @ на '!' с помощью глобального поиска и замены.





//**2 */
//Дана строка 'aaa bbb ccc'. Вырежите из нее слово 'bbb' тремя разными способами (через substr, substring, slice).


  

//**3 */
//В переменной date лежит дата в формате '2025-12-31'. Преобразуйте эту дату в формат '31/12/2025'.





//**4 */
//Дана строка 'JS'. Сделайте из нее строку 'js'






//**5 */
//Дана строка 'я учу javascript!'. Вырежите из нее слово 'учу' и слово 'javascript'







//**6 */
//Дана строка 'я учу javascript!'. Найдите позицию подстроки 'учу'.






//**7 */
//Дана строка 'Я-учу-javascript!'. Замените все дефисы на '!' с помощью глобального поиска и замены.





//**8 */
//Преобразуйте первую букву строки в верхний регистр.






//**9 */
//Преобразуйте первую букву каждого слова строки в верхний регистр.






//**10 */
//Преобразуйте строку 'var_test_text' в 'varTestText'. Скрипт, конечно же, должен работать с любыми аналогичными строками